import 'package:look_talk/model/entity/notice_entity.dart';

final List<NoticeEntity> noticeEntity = [
  NoticeEntity(
    id: 1,
    title: "통합 서비스 이용약관 개정 안내",
    currentAt : "2025.06.29",
    content: """
    안녕하세요, 룩톡입니다.
    더 나은 서비스 제공을 위해 통합 서비스 이용약관이 아래와 같이 개정될 예정입니다. 이용에 참고 부탁드립니다.

  ■ 주요 변경 사항
  개인정보 처리 및 제3자 제공 관련 내용 추가
  회원 탈퇴 및 이용 제한 조건 명확화
  이용자 권리 및 의무 항목 보완

  ■ 시행일
  2025년 7월 15일

  개정된 약관 전문은 룩톡 앱 내 공지사항에서 확인하실 수 있습니다. 시행일까지 별도의 이의 제기 없이 서비스를 계속 이용하시는 경우, 개정 약관에 동의하신 것으로 간주됩니다.

  감사합니다.
   룩톡 운영팀 드림
  """
  ),
  NoticeEntity(
      id: 2,
      title: "통합 서비스 이용약관 수정할게요",
      currentAt : "2025.06.30",
      content: """
    안녕하세요, 룩톡입니다.
    더 나은 서비스 제공을 위해 통합 서비스 이용약관이 아래와 같이 개정될 예정입니다. 이용에 참고 부탁드립니다.

  ■ 주요 변경 사항
  개인정보 처리 및 제3자 제공 관련 내용 추가
  회원 탈퇴 및 이용 제한 조건 명확화
  이용자 권리 및 의무 항목 보완

  ■ 시행일
  2025년 7월 15일

  개정된 약관 전문은 룩톡 앱 내 공지사항에서 확인하실 수 있습니다. 시행일까지 별도의 이의 제기 없이 서비스를 계속 이용하시는 경우, 개정 약관에 동의하신 것으로 간주됩니다.

  감사합니다.
   룩톡 운영팀 드림
  """
  )
];